# YOLOv5 馃殌 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 1, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

head:
  [[-1, 1, Conv, [512, 1, 1]], # 10 256 20 20 

  [10, 1, Split_1, [4]], # 11 64 20 20
  [10, 1, Split_2, [4]], # 12 192 20 20

  [6, 1, Split_1, [4]], # 13 64 40 40
  [6, 1, Split_2, [4]], # 14 192 40 40

  [4, 1, Split_1, [4]], # 15 32 80 80
  [4, 1, Split_2, [4]], # 16 96 80 80

  [12, 1, Conv, [192, 1, 1]], # 17 96 20 20
  [14, 1, Conv, [96, 1, 1]],  # 18 48 40 40
  [16, 1, Conv, [48, 1, 1]],  # 19 24 80 80

  [11, 1, nn.Upsample, [None, 2, 'nearest']], # 20 64 40 40
  [[-1, 13], 1, Concat, [1]], # 21 128 40 40
  [-1, 1, C3, [128, False]], # 22 64 40 40

  [-1, 1, Conv, [64, 1, 1]], # 23 32 40 40
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], #24 32 80 80
  [[-1, 15], 1, Concat, [1]], # 25 64 80 80
  [-1, 1, C3, [64, False]], # 26 32 80 80

  [[19, 18, 17], 1, ASFF_3, [48, 0]],  #27 24 80 80
  [[-1, -2], 1, Concat, [1]], # 28 128 80 80
  [-1, 1, C3, [256, False]], # 29 128 80 80

  [26, 1, Conv, [64, 3, 2]], # 30 32 40 40
  [[-1, 20], 1, Concat, [1]], # 31 64 40 40
  [-1, 1, C3, [128, False]], # 32 64 40 40

  [[19, 18, 17], 1, ASFF_3, [96, 1]],  #33 48 40 40
  [[-1, -2], 1, Concat, [1]], # 34 256 40 40
  [-1, 1, C3, [512, False]], # 35 256 40 40

  [32, 1, Conv, [128, 3, 2]], # 36 64 20 20
  [[-1, 11], 1, Concat, [1]], # 37 128 20 20
  [-1, 1, C3, [128, False]], # 38 64 20 20
  
  [[19, 18, 17], 1, ASFF_3, [192, 2]],  #39 48 20 20
  [[-1, -2], 1, Concat, [1]], # 40 256 20 20
  [-1, 1, C3, [1024, False]], # 41 512 20 20

  [[29, 35, 41], 1, Detect, [nc, anchors]],
  ]
