# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  #10 256 20 20
   [-1, 1, Conv, [128, 1, 1]],  #11 64 20 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 12 64 40 40
   [6, 1, Conv, [128, 1, 1]],  #13 64 40 40
   [[-1, -2], 1, Concat, [1]], #14 128 40 40
   [4, 1, Conv, [128, 3, 2]], #15 64 40 40
   [[-1, 13], 1, Concat, [1]], # 16 128 40 40
   
   [10, 1, nn.Upsample, [None, 2, 'nearest']], # 256 40 40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13  # 256 40 40

   [-1, 1, Conv, [256, 1, 1]], # 20 128 40 40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 128 80 80
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 # 256 80 80 
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small) #128 80 80
 
   [-1, 1, Conv, [256, 3, 2]],  #128 40 40
   [[-1, 20], 1, Concat, [1]],  # cat head P4  256 40 40
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium) 256 40 40

   [-1, 1, Conv, [512, 3, 2]], # 256 20 20
   [[-1, 10], 1, Concat, [1]],  # cat head P5 512 20 20
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
