# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #10 20 20 256
  [-1, 1, Split_1, [2]], # 11 20 20 128
  [-2, 1, Split_1, [2]], #12 20 20 128
  [6, 1, Split_1, [2]], #13 40 40 128
  [6, 1, Split_1, [2]], #14 40 40 125

  [11, 1, nn.Upsample, [None, 2, 'nearest']], #15 40 40 128
  [12, 1, nn.Upsample, [None, 2, 'nearest']], #16 40 40 128
  [[-1, -2, 13], 1, Concat, [1]], #17 40 40 384
  [-1, 3, C3, [256, False]], # 18 40 40 128

  [-1, 1, Conv, [256, 1, 1]], #19 40 40 128
  [-1, 1, nn.Upsample, [None, 2, 'nearest']], #20 80 80 128
  [14, 1, nn.Upsample, [None, 2, 'nearest']], #21 80 80 128
  [[-1, -2, 4], 1, Concat, [1]], #22 80 80 384
  [-1, 3, C3, [256, False]], #23 80 80 128

  [-1, 1, Conv, [256, 3, 2]], #24 40 40 128
  [[-1, 19], 1, Concat, [1]], #25 40 40 256
  [-1, 3, C3, [512, False]], #26 40 40 256

  [-1, 1, Conv, [512, 3, 2]], #27 20 20 256
  [[-1, 10], 1, Concat, [1]], #28 20 20 512
  [-1, 3, C3, [1024, False]], #29 20 20 512

  [[23, 26, 29], 1, Detect, [nc, anchors]],
  ]
